# Select, Delete, Insert of Series and DataFrame

In [3]:
pwd

'/Users/tako/Desktop/TAKO_Python_Playground/pandas'

In [4]:
import numpy as np
import pandas as pd

## 1. Series

In [5]:
data = [79, 85, 98, 100, 67]
index = ['Mike', 'Jack', 'Bob', 'Jonathon', 'Niha']
s = pd.Series(data = data, index = index, name = 'Math')
s

Mike         79
Jack         85
Bob          98
Jonathon    100
Niha         67
Name: Math, dtype: int64

### 1.1 Select
#### 1.1.1 .loc[ ] base on index

In [6]:
s.loc['Mike']

79

In [7]:
s.loc['Jack':'Niha']

Jack         85
Bob          98
Jonathon    100
Niha         67
Name: Math, dtype: int64

In [8]:
s>80

Mike        False
Jack         True
Bob          True
Jonathon     True
Niha        False
Name: Math, dtype: bool

In [9]:
s.loc[s>80]

Jack         85
Bob          98
Jonathon    100
Name: Math, dtype: int64

#### 1.1.2 .iloc[ ] base on location

In [10]:
s.iloc[0]

79

In [11]:
s.iloc[2:5]

Bob          98
Jonathon    100
Niha         67
Name: Math, dtype: int64

In [12]:
s.iloc[[2,4]]

Bob     98
Niha    67
Name: Math, dtype: int64

In [13]:
s.iloc[[True,False,False,True,True]]

Mike         79
Jonathon    100
Niha         67
Name: Math, dtype: int64

### 1.2 Updata
#### 1.2.1 Updata data

In [14]:
s

Mike         79
Jack         85
Bob          98
Jonathon    100
Niha         67
Name: Math, dtype: int64

In [15]:
s.loc['Jonathon'] = 95

In [16]:
s

Mike        79
Jack        85
Bob         98
Jonathon    95
Niha        67
Name: Math, dtype: int64

In [17]:
s.replace(to_replace= 95, value = 100)

Mike         79
Jack         85
Bob          98
Jonathon    100
Niha         67
Name: Math, dtype: int64

In [18]:
s = s.replace(to_replace= 95, value = 100)

In [19]:
s

Mike         79
Jack         85
Bob          98
Jonathon    100
Niha         67
Name: Math, dtype: int64

#### 1.2.2 update index

In [20]:
# change Series.index
s.index

Index(['Mike', 'Jack', 'Bob', 'Jonathon', 'Niha'], dtype='object')

In [21]:
s.index = ['Mike', 'Jack', 'Bob', 'Jonathon', 'TAKO']

In [22]:
# use rename method
s.rename(index = {'TAKO':'Tako'}, inplace = True)

In [23]:
s

Mike         79
Jack         85
Bob          98
Jonathon    100
Tako         67
Name: Math, dtype: int64

### 1.3 Insert

In [24]:
# plain assignment
s.loc['Jerry'] = 45
s

Mike         79
Jack         85
Bob          98
Jonathon    100
Tako         67
Jerry        45
Name: Math, dtype: int64

In [25]:
# use append method

In [26]:
s.append(pd.Series([90,80,90,100], index = ['Cat','Dog','Bird','Fish']))

Mike         79
Jack         85
Bob          98
Jonathon    100
Tako         67
Jerry        45
Cat          90
Dog          80
Bird         90
Fish        100
dtype: int64

In [27]:
s = s.append(pd.Series([90,80,90,100], index = ['Cat','Dog','Bird','Fish']))
s

Mike         79
Jack         85
Bob          98
Jonathon    100
Tako         67
Jerry        45
Cat          90
Dog          80
Bird         90
Fish        100
dtype: int64

### 1.4 Delete

In [28]:
s.drop(['Cat','Dog','Bird','Fish'], inplace = True)

In [29]:
s

Mike         79
Jack         85
Bob          98
Jonathon    100
Tako         67
Jerry        45
dtype: int64

## 2. DataFrame

In [30]:
s1 = s.copy()
s1.name = 'Math'
s2 = pd.Series([80,77,87,60,90,100], index = s1.index)
s2.name = 'English'
df = pd.DataFrame({'math':s1,'history':s2})
df

          math  history
Mike        79       80
Jack        85       77
Bob         98       87
Jonathon   100       60
Tako        67       90
Jerry       45      100

### 2.1 Select
#### 2.1.1 .loc[ ] base on index and column

In [31]:
df.loc['Mike','math']

79

In [32]:
df.loc['Mike',:]

math       79
history    80
Name: Mike, dtype: int64

In [33]:
df.loc['Bob':'Jerry','history']

Bob          87
Jonathon     60
Tako         90
Jerry       100
Name: history, dtype: int64

In [34]:
df.loc[['Mike','Tako'], 'math']

Mike    79
Tako    67
Name: math, dtype: int64

In [38]:
a = df.loc[:,'math']>90
a

Mike        False
Jack        False
Bob          True
Jonathon     True
Tako        False
Jerry       False
Name: math, dtype: bool

In [39]:
df.loc[a]

          math  history
Bob         98       87
Jonathon   100       60

#### 2.1.2 .iloc[ ] base on location

In [41]:
df.iloc[0,1]

80

In [42]:
df.iloc[0:2,1]

Mike    80
Jack    77
Name: history, dtype: int64

In [43]:
df.iloc[[1,3,4,5],0]

Jack         85
Jonathon    100
Tako         67
Jerry        45
Name: math, dtype: int64

### 2.2 Update
#### 2.2.1 Update the value

In [44]:
df

          math  history
Mike        79       80
Jack        85       77
Bob         98       87
Jonathon   100       60
Tako        67       90
Jerry       45      100

In [45]:
# by assignment
df.loc['Mike','math'] = 100
df

          math  history
Mike       100       80
Jack        85       77
Bob         98       87
Jonathon   100       60
Tako        67       90
Jerry       45      100

In [46]:
# by method
df.replace(100,90,inplace=True)
df

          math  history
Mike        90       80
Jack        85       77
Bob         98       87
Jonathon    90       60
Tako        67       90
Jerry       45       90

#### 2.2.2 Update the index

In [49]:
# change by assignment
df.index = ['Mike', 'Jack', 'Bob', 'Jonathon', 'Tako', 'Terri']

In [50]:
df

          math  history
Mike        90       80
Jack        85       77
Bob         98       87
Jonathon    90       60
Tako        67       90
Terri       45       90

In [53]:
# change by method
df.rename(index = {'Terri':'Jerry', 'Jack':'Jackson'}, inplace=True)
df

          math  history
Mike        90       80
Jackson     85       77
Bob         98       87
Jonathon    90       60
Tako        67       90
Jerry       45       90

### 2.3 Insert
#### 2.3.1 Insert by row

In [55]:
# by assignment
df.loc['Terri'] = [90,30]
df

          math  history
Mike        90       80
Jackson     85       77
Bob         98       87
Jonathon    90       60
Tako        67       90
Jerry       45       90
Terri       90       30

In [61]:
# by function
dfnew = pd.DataFrame([[20,30],[50,60]],index = ['Ted','Salina'], columns = df.columns)
pd.concat([df,dfnew], axis = 0,)

          math  history
Mike        90       80
Jackson     85       77
Bob         98       87
Jonathon    90       60
Tako        67       90
Jerry       45       90
Terri       90       30
Ted         20       30
Salina      50       60

#### 2.3.2 Insert by column

In [63]:
# by assignment
df.loc[:,'english'] = [100,98,99,97,99,90,92]
df

          math  history  english
Mike        90       80      100
Jackson     85       77       98
Bob         98       87       99
Jonathon    90       60       97
Tako        67       90       99
Jerry       45       90       90
Terri       90       30       92

In [68]:
# by function
dfnew = pd.DataFrame([100,98,99,97,99,90,92], index = df.index, columns = ['french'])
pd.concat([df,dfnew], axis = 1)

          math  history  english  french
Mike        90       80      100     100
Jackson     85       77       98      98
Bob         98       87       99      99
Jonathon    90       60       97      97
Tako        67       90       99      99
Jerry       45       90       90      90
Terri       90       30       92      92

### 2.4 Delete

In [69]:
df

          math  history  english
Mike        90       80      100
Jackson     85       77       98
Bob         98       87       99
Jonathon    90       60       97
Tako        67       90       99
Jerry       45       90       90
Terri       90       30       92

#### 2.4.1 Delete by row

In [70]:
df.drop(['Jerry','Terri'], axis = 0)

          math  history  english
Mike        90       80      100
Jackson     85       77       98
Bob         98       87       99
Jonathon    90       60       97
Tako        67       90       99

#### 2.4.2 Delete by columns

In [73]:
df.drop(['english'],axis = 1)

          math  history
Mike        90       80
Jackson     85       77
Bob         98       87
Jonathon    90       60
Tako        67       90
Jerry       45       90
Terri       90       30

Now you know how CURD operations are in pandas!